In [10]:
import pandas as pd

In [11]:
data=[[1,2,3],[7,8,9],[4,5,6]]

In [12]:
series=list('321')

In [13]:
df=pd.DataFrame(data, list('321'), list('ZXY'))

In [14]:
df

   Z  X  Y
3  1  2  3
2  7  8  9
1  4  5  6

In [15]:
df.sort_index(inplace=True, axis=1)

In [16]:
df

   X  Y  Z
3  2  3  1
2  8  9  7
1  5  6  4

In [17]:
df.sort_values(by='X', inplace=True)

In [18]:
df

   X  Y  Z
3  2  3  1
1  5  6  4
2  8  9  7

In [27]:
df.sort_values(by='3', axis=1, inplace=False)
df

   Z  X  Y
3  1  2  3
1  4  5  6
2  7  8  9

In [30]:
df.sort_index(axis=0, inplace=True)
df

   X  Y  Z
1  5  6  4
2  8  9  7
3  2  3  1

In [31]:
df.sort_index()

   X  Y  Z
1  5  6  4
2  8  9  7
3  2  3  1